app/views/formularios/_selecao_velorio.html.erb

					<%= label_tag :cemiterio_id, "Local de Sepultamento/Cremação" %>
					<%= select_tag :cemiterio_id, options_for_select(Cemiterio.all.collect{ |u| [u.nome, u.id] }), class: 'form-control' %><br>
---
SELECT "cemiterios".* FROM "cemiterios"

						<%= label_tag :velorio_id, "Selecione o local de velório" %>
						<%= select_tag :velorio_id, options_for_select(Velorio.all.collect{ |v| [v.nome, v.id] }), class: 'form-control' %>
---
SELECT "velorios".* FROM "velorios"