app/views/formularios/selecao_velorio.html.erb

			<%= label_tag :cemiterio_id, "Local de Sepultamento/Cremação" %>
		    <%= select_tag :cemiterio_id, options_for_select(Cemiterio.all.collect{ |u| [u.nome, u.id] }), class: 'form-control' %>
---
SELECT "cemiterios".* FROM "cemiterios"

		    <%= check_box_tag :mesmo_local, value = "1", checked = true %>
		    <%= select_tag :velorio_id, options_for_select(Velorio.all.collect{ |v| [v.nome, v.id] }), class: 'form-control' %>
---
SELECT "velorios".* FROM "velorios"