app/controllers/formularios_controller.rb

  def selecao_velorio
  	@cemiterios = Cemiterio.all
  	@velorios = Velorio.all
---
SELECT "cemiterios".* FROM "cemiterios"
SELECT "velorios".* FROM "velorios"

  def filtro_salas
    @sepultamento = Cemiterio.find(params[:cemiterio_id])
    if params[:mesmo_local] != "1"
      @velorio = Velorio.find(params[:velorio_id])
    else
      @velorio = Velorio.find_by(nome: @sepultamento.nome)
    end
    @reserva = Reserva.create(atendente_id: current_funcionario.id, cemiterio_id: @sepultamento.id)
    @salas = @velorio.salas
    @array_salas = []
    gon.array = @array_salas
    @salas.each do |s|
---
SELECT  "cemiterios".* FROM "cemiterios" WHERE "cemiterios"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "velorios".* FROM "velorios" WHERE "velorios"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "velorios".* FROM "velorios" WHERE "velorios"."nome" = ? LIMIT 1  [["nome", "Alphacampus"]]
INSERT INTO "atendentes" ("adm", "funcionario_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["adm", "t"], ["funcionario_id", 1], ["created_at", "2015-10-23 16:45:15.987866"], ["updated_at", "2015-10-23 16:45:15.987866"]]
INSERT INTO "funcionarios" ("rf", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["rf", "0000000"], ["password_digest", "$2a$10$wun1RbvbVV.3U5piXt9nEeWxoLgIkfREdCnRxL5moUnpv1gvAIHi2"], ["created_at", "2015-10-23 16:43:37.520162"], ["updated_at", "2015-10-23 16:43:37.520162"]]
INSERT INTO "reservas" ("atendente_id", "cemiterio_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["atendente_id", 1], ["cemiterio_id", 28], ["created_at", "2015-10-23 17:00:31.062430"], ["updated_at", "2015-10-23 17:00:31.062430"]]
SELECT "salas".* FROM "salas" WHERE "salas"."velorio_id" = ?  [["velorio_id", 1]]

  def confirmacao_reserva
  	@reserva = Reserva.find(params[:reserva_id])
  	@h_sepul = date_time_from_date_time_select_params(params[:horario_sepultamento], 'horario')
  	@h_sepul_fix = fix_time(@h_sepul.to_time)
  	@reserva.update_attributes(sala_id: params[:sala_id], sepultamento: @h_sepul_fix, inicio: Time.now.in_time_zone)
---
SELECT  "reservas".* FROM "reservas" WHERE "reservas"."id" = ? LIMIT 1  [["id", 34]]
UPDATE "reservas" SET "sala_id" = ?, "sepultamento" = ?, "inicio" = ?, "updated_at" = ? WHERE "reservas"."id" = ?  [["sala_id", 2], ["sepultamento", nil], ["inicio", "2015-10-26 17:01:47.713423"], ["updated_at", "2015-10-26 17:01:47.723145"], ["id", 58]]