app/controllers/formularios_controller.rb

  def main
    @reserva = Reserva.new
    @cem_aux = []
    gon.cemiterios = {}
    Cemiterio.all.each do |c|
---
SELECT "cemiterios".* FROM "cemiterios"