app/controllers/sessions_controller.rb

SELECT  "funcionarios".* FROM "funcionarios" WHERE "funcionarios"."rf" = ? LIMIT 1  [["rf", "0000000"]]
---
	def create
		funcionario = Funcionario.find_by(rf: params[:session][:rf].downcase)